## Quiz #0201

Name: Mohamamd Abdul Rafay<br>
Roll Number: BSE183009

In [12]:
import pandas as pd
import os
import numpy as np

#### Read in the data.

In [ ]:
# Go to the directory where the data file is located. 
# os.chdir(r'~~')                # Please, replace the path with your own.

In [2]:
df = pd.read_csv('data_studentlist.csv', header='infer')

In [3]:
df.head(5)

              name gender  age  grade absence bloodtype  height  weight
0    Jared Diamond      M   23      3       Y         O   165.3    68.2
1   Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
2     Brian Martin      M   24      4       N         B   175.0    80.1
3     David Hassel      M   23      3       N        AB   182.1    85.7
4  Clara Rodriquez      F   20      1       Y         A   168.0    49.5

#### Answer the following questions using Pandas library.

1). Average height of the male students:

In [27]:
male=df[df.gender == 'M']

solution= male.height
print(solution.mean())

172.41

2). Average height of the female students:

In [28]:
female=df[df.gender == 'F']

solution= female.height
print(solution.mean())

166.64285714285714

3). Average weight of the male students:

In [30]:
# getting the males
male=df[df.gender == 'M']
#print(male)
avg_weight =male.weight
print(avg_weight.mean())

68.50000000000001

4). Average weight of the female students:

In [31]:
female=df[df.gender == 'F']
#print(male)
avg_weight =female.weight
print(avg_weight.mean())

50.44285714285714

5). The tallest height among the male students:

In [34]:
male=df[df.gender == 'M']
#print(male)
max_height= male.height
print(max_height.max())

182.1

6). The shortest height among the female students:

In [35]:
male=df[df.gender == 'M']
#print(male)
max_height= male.height
print(max_height.min())

162.2

7). The lightest weight among the male students of height taller than 175cm:

In [56]:
df[(df.gender =='M') & (df.height> 175)]

              name gender  age  grade absence bloodtype  height  weight
3     David Hassel      M   23      3       N        AB   182.1    85.7
8     John Bertsch      M   23      3       N         B   178.5    64.2
9   Jake Timmerman      M   22      2       N         B   176.1    61.3
11    John Matsuda      M   22      2       N        AB   180.0    75.8

8). The heaviest weight among the female students of height shorter than 160cm:

In [58]:
df[(df.gender =='F') & (df.height< 160)]

            name gender  age  grade absence bloodtype  height  weight
6    Susan Clark      F   22      1       N         O   155.2    45.3
14  Linda Carter      F   22      2       N         B   158.2    45.2

9). The average grade of students without absence ('N'):

In [70]:
good_grade=df[(df.absence == 'N')]
good_grade.grade.mean()

2.076923076923077

10). The average grade of students with absence ('Y'):

In [69]:
good_grade=df[(df.absence == 'Y')]
good_grade.grade.mean()

3.0

11). Average height of the students with blood type 'A' or 'AB':

In [87]:
df
new_data=df.loc[(df.bloodtype=='A') | (df.bloodtype=='AB')]
print(new_data)
new_data.height.mean()

               name gender  age  grade absence bloodtype  height  weight
1    Sarah O'Donnel      F   22      2       N        AB   170.1    53.0
3      David Hassel      M   23      3       N        AB   182.1    85.7
4   Clara Rodriquez      F   20      1       Y         A   168.0    49.5
7   Margareth Jones      F   23      1       N         A   176.9    55.0
11     John Matsuda      M   22      2       N        AB   180.0    75.8
12     Eddy Johnson      M   21      1       N         A   162.2    55.3
16      Andrew King      M   21      1       N         A   169.2    62.2

172.64285714285714

12). Average height of the **male** students with blood type 'A' or 'AB':

In [100]:
new_data=df.loc[(df.bloodtype=='A') | (df.bloodtype=='AB')]
new_data
new_male_height=new_data.loc[(new_data.gender=='M')]
print(new_male_height)
print(' ')
print(new_male_height.height.mean())

            name gender  age  grade absence bloodtype  height  weight
3   David Hassel      M   23      3       N        AB   182.1    85.7
11  John Matsuda      M   22      2       N        AB   180.0    75.8
12  Eddy Johnson      M   21      1       N         A   162.2    55.3
16   Andrew King      M   21      1       N         A   169.2    62.2

173.375

13). Average age of the students with absence ('Y') whose grade is equal or larger than 3:

In [102]:
good_grade=df[(df.absence == 'Y') & (df.grade >= 3)]
good_grade

              name gender  age  grade absence bloodtype  height  weight
0    Jared Diamond      M   23      3       Y         O   165.3    68.2
10   Joshua Connor      M   24      4       Y         O   167.1    62.0
15  Richard Swayze      M   24      4       Y         B   168.6    70.2